app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Rafael"], ["updated_at", "2020-10-12 20:23:05.539462"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)